RIOT-OS/RIOT/cpu/cc13x2/radio/cc13x2_rf_prop_internal.c
exit:
    return error;
}

int_fast8_t cc13x2_rf_rx_stop(void)
{
    int_fast8_t error = 0;

    if (_cc13x2_rf_state == cc13x2_stateReceive)
    {
        if (!(rfCoreExecuteAbortCmd() == CMDSTA_Done)) {
            error = -1;
            goto exit;
        }

        _cc13x2_rf_state = cc13x2_stateSleep;
        error  = 0;
    }

exit:
    return error;
}

uint8_t cc13x2_rf_get_chan(void)
{
    return _channel;
}

void cc13x2_rf_set_chan(uint16_t channel)
{
    if (_channel == channel) {
        return;
    }

    int rx_was_active = (_cc13x2_rf_state == cc13x2_stateReceive);

    if (rx_was_active) {
        cc13x2_rf_rx_stop();
    }

    const uint32_t new_freq = ieee802154_freq(channel);
    const uint16_t freq = (uint16_t)(new_freq / 1000);
    const uint16_t frac = (uint16_t)(((new_freq - (freq * 1000)) * 0x10000) / 1000);

    assert(rfCoreSendFsCmd(freq, frac) == CMDSTA_Done);

    _channel = channel;

    if (rx_was_active) {
        cc13x2_rf_rx_start();
    }
    // TODO: handle cc13x2_rf_state == cc13x2_stateTransmit

    return;
}

/**
 * Function documented in platform/radio.h
 */
void cc13x2_rf_get_ieee_eui64(uint8_t *aIeeeEui64)
{
    uint8_t *    eui64;
    unsigned int i;

    /*
     * The IEEE MAC address can be stored two places. We check the Customer
     * Configuration was not set before defaulting to the Factory
     * Configuration.
     */
    eui64 = (uint8_t *)(CCFG_BASE + CCFG_O_IEEE_MAC_0);

    for (i = 0; i < 8; i++)
    {
        if (eui64[i] != CCFG_UNKNOWN_EUI64)
        {
            break;
        }
    }

    if (i >= 8)
    {
        /* The ccfg address was all 0xFF, switch to the fcfg */
        eui64 = (uint8_t *)(FCFG1_BASE + FCFG1_O_MAC_15_4_0);
    }

    /*
     * The IEEE MAC address is stored in network byte order.  The caller seems
     * to want the address stored in little endian format, which is backwards
     * of the conventions setup by @ref rfSetExtendedAddress.
     * rfSetExtendedAddress assumes that the address being passed to
     * it is in network byte order, so the caller of
     * rfSetExtendedAddress must swap the endianness before calling.
     *
     * It may be easier to have the caller of this function store the IEEE
     * address in network byte order.
     */
    for (i = 0; i < 8; i++)
    {
        aIeeeEui64[i] = eui64[(8 - 1) - i];
    }
}

void cc13x2_rf_irq_set_handler(void(*handler)(void *), void * arg)
{
    _irq_handler = handler;
    _irq_handler_arg = arg;
}

int cc13x2_rf_recv(void *buf, size_t len, netdev_ieee802154_rx_info_t *rx_info)
{
    rfc_ieeeRxCorrCrc_t *   crcCorr;
    rfc_dataEntryGeneral_t *curEntry, *startEntry;
    uint8_t                 rssi;
    (void)rssi;

    startEntry = (rfc_dataEntryGeneral_t *)sRxDataQueue.pCurrEntry;
    curEntry   = startEntry;

    /* loop through receive queue */
    do {
        uint8_t *payload = &(curEntry->data);

        if (curEntry->status == DATA_ENTRY_FINISHED) {
            uint8_t      payload_len;

            /* get the information appended to the end of the frame.
             * This array access looks like it is a fencepost error, but the
             * first byte is the number of bytes that follow.
             */
            payload_len = payload[0];
            crcCorr     = (rfc_ieeeRxCorrCrc_t *)&payload[len];
            rssi        = payload[payload_len - 1];

            if (crcCorr->status.bCrcErr == 0 && (payload_len - 2) < 144) {
                if (!buf) {
                    if (!len) {
                        return payload_len;
                    }
                    if (len == payload_len) {
                        /* drop packet */
                        curEntry->status = DATA_ENTRY_PENDING;
                        return 0;
                    }
                }

                if (payload_len > len) {
                    return -ENOSPC;
                }

                /* substract checksum bytes */
                payload_len -= 2;

                /* copy packet data */
                memcpy(buf, &(payload[1]), payload_len);

                /* save rx info */
                if (rx_info) {
                    rx_info->rssi = rssi;
                    rx_info->lqi = crcCorr->status.corr;
                }

                curEntry->status = DATA_ENTRY_PENDING;

                return payload_len;
            }
            else {
                puts("recv error fcs");
            }
            curEntry->status = DATA_ENTRY_PENDING;
        }

        curEntry = (rfc_dataEntryGeneral_t *)(curEntry->pNextEntry);
    } while (curEntry != startEntry);
    return 0;
}

int cc13x2_rf_recv_avail(void)
{
    rfc_dataEntryGeneral_t *curEntry, *startEntry;

    startEntry = (rfc_dataEntryGeneral_t *)sRxDataQueue.pCurrEntry;
    curEntry   = startEntry;

    /* loop through receive queue */
    do {
        if (curEntry->status == DATA_ENTRY_FINISHED) {
            return 1;
        }

        curEntry = (rfc_dataEntryGeneral_t *)(curEntry->pNextEntry);
    } while (curEntry != startEntry);
    return 0;
}

int cc13x2_rf_send(const iolist_t *iolist)
{
    unsigned error = -EAGAIN;

    if (_cc13x2_rf_state == cc13x2_stateReceive)
    {
        size_t len = 0;
        uint8_t *bufpos = sTxBuf0;

        for (const iolist_t *iol = iolist; iol; iol = iol->iol_next) {
            len += iol->iol_len;
            if (len > TX_BUF_SIZE) {
//                DEBUG("cc13x2_rf: error: packet too large (%u bytes to be sent)\n",
//                      (unsigned)len);
                error = -EOVERFLOW;
                goto exit;
            }

            memcpy(bufpos, iol->iol_base, iol->iol_len);
            bufpos += iol->iol_len;
        }

        _cc13x2_rf_state = cc13x2_stateTransmit;

        if (!(rfCoreSendTransmitCmd(sTxBuf0, len) == CMDSTA_Done)) {
            error = -1;
            goto exit;
        }

        sTxCmdChainDone = false;

        return len;
    }

exit:
    _cc13x2_rf_state = cc13x2_stateTransmit;

    return error;
}

unsigned cc13x2_rf_irq_is_enabled(unsigned irq)
{
    return (HWREG(RFC_DBELL_NONBUF_BASE + RFC_DBELL_O_RFCPEIEN) & irq) != 0;
}

void cc13x2_rf_irq_enable(unsigned irq)
{
    HWREG(RFC_DBELL_NONBUF_BASE + RFC_DBELL_O_RFCPEIFG) = ~irq;
    HWREG(RFC_DBELL_NONBUF_BASE + RFC_DBELL_O_RFCPEIEN) |= irq;
}

void cc13x2_rf_irq_disable(unsigned irq)
{
    HWREG(RFC_DBELL_NONBUF_BASE + RFC_DBELL_O_RFCPEIEN) &= ~irq;
}

void cc13x2_rf_set_pan(uint16_t aPanId)
{
    (void)aPanId;
}

uint16_t cc13x2_rf_get_pan(void)
{
    return 0x0000;
}

/**
 * Function documented in platform/radio.h
 *
 * @note it is entirely possible for this function to fail, but there is no
 * valid way to return that error since the function prototype was changed.
 */
void cc13x2_set_short_addr(uint16_t aAddress)
{
    (void)aAddress;
    /* XXX: todo? */
}

unsigned cc13x2_rf_get_flags(void)
{
    unsigned flags = sFlags;
    sFlags = 0;
    return flags;
}
